tap "homebrew/bundle"
tap "lotyp/homebrew-formulae"

# ==> Formulae
brew "coreutils"
brew "stow"
brew "bat"
brew "tree"
brew "fzf"
brew "gnu-sed"
brew "jq"
brew "gh"
brew "shellcheck"
brew "vim"
brew "node"
brew "docker"
brew "the-silver-searcher" # ag for fzf
brew "ripgrep" # rg for fzf

# ==>  Casks
cask "1password-cli"
cask "CLion"
cask "WebStorm"
cask "google-chrome"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "zoom"
cask "jetbrains-toolbox"
cask "DevToys"
cask "gitkraken"
cask "Postman"
cask "Github"
cask "homebrew/cask/docker"
cask "app-cleaner"
cask "homebrew/cask/termius"
cask "Rectangle"
cask "Figma"
cask "Discord"
cask "Obsidian"
cask "WhatsApp"
cask "Warp"
cask "TickTick"
cask "VirtualBox"
