tap "homebrew/bundle"
tap "lotyp/homebrew-formulae"

# ==> Formulae
brew "coreutils"
brew "stow"
brew "bat"
brew "tree"
brew "fzf"
brew "gnu-sed"
brew "jq"
brew "gh"
brew "shellcheck"
brew "vim"
brew "node"
brew "docker"
brew "the-silver-searcher" # ag for fzf
brew "ripgrep" # rg for fzf

# ==>  Casks
cask "1password-cli"

# TODO: to be tested
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "zoomus"
cask "jetbrains-toolbox"
cask "CLion"
cask "WebStorm"
cask "DevToys"
cask "GitKraken"
cask "Postman"
cask "Github Desktop"
cask "Docker" # Docker Desktop
cask "App Cleaner"
cask "Rectangle"
cask "Figma"
cask "Discord"
cask "Obsidian"
cask "WhatsApp"
cask "Shazam"
cask "Warp"
cask "TickTick"
cask "Termius"
cask "VirtualBox"
